'''
说明
有一个火车站，铁路如图所示，每辆火车从A驶入，再从B方向驶出，同时它的车厢可以重新组合。假设从A方向驶来的火车有n节（n<=1000），分别按照顺序编号为1，2，3，…，n。假定在进入车站前，每节车厢之间都不是连着的，并且它们可以自行移动到B处的铁轨上。另外假定车站C可以停放任意多节车厢。但是一旦进入车站C，它就不能再回到A方向的铁轨上了，并且一旦当它进入B方向的铁轨，它就不能再回到车站C。
img

负责车厢调度的工作人员需要知道能否使它以a1,a2,…,an的顺序从B方向驶出，请来判断能否得到指定的车厢顺序。

输入格式
输入文件的第一行为一个整数n，其中n<=1000，表示有n节车厢，第二行为n个数字，表示指定的车厢顺序。
'输出格式
如果可以得到指定的车厢顺序，则输出一个字符串”YES”，否则输出”NO”（注意要大写，不包含引号）。
输入数据 1
5
5 4 3 2 1
输出数据 1
YES
'''
'''
20
2 1 10 9 8 7 6 12 11 13 14 15 18 19 17 16 20 5 4 3
'''
n=int(input())
l=list(map(int,input().split()))
sta=[]
cur=0
s=1
while cur!=n and s!=n+1:
    sta.append(s)
    while len(sta)!=0 and sta[-1]==l[cur]:
        sta.pop()
        cur+=1
    s+=1

if cur==n:
    print('YES')
else:
    print('NO')
